### Plan for `TRANSACT/non-prod`
```terraform

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

### Plan for `TRANSACT/prod`
```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # newrelic_entity_tags.synthetic_tags["CREATE_HC_PING_TAG642"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "customer_name"
          + values = [
              + "manning",
            ]
        }
      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "CWP_Healthcheck",
            ]
        }
      + tag {
          + key    = "tags.url"
          + values = [
              + "healthcheck",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["FOUNDATION_PING_TAG42"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "FOUNDATION",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["LITIGATE_PING_TAG1"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "LITIGATE",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["LITIGATE_PING_TAG2"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "LITIGATE",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["LITIGATE_PING_TAG3"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "LITIGATE",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["TRANSACT_PING_TAG1"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "TRANSACT",
            ]
        }
      + tag {
          + key    = "tags.team"
          + values = [
              + "prod-au",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_entity_tags.synthetic_tags["TRANSACT_PING_TAG2"] will be created
  + resource "newrelic_entity_tags" "synthetic_tags" {
      + guid = (known after apply)
      + id   = (known after apply)

      + tag {
          + key    = "env"
          + values = [
              + "live",
            ]
        }
      + tag {
          + key    = "product"
          + values = [
              + "TRANSACT",
            ]
        }
      + tag {
          + key    = "tags.team"
          + values = [
              + "prod-us",
            ]
        }
      + tag {
          + key    = "type"
          + values = [
              + "ping",
            ]
        }
    }

  # newrelic_synthetics_monitor.synthetic_monitor["CREATE_HC_PING642"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "CREATE - PING test for https://HE3629882.us.create.litera.com:8446/health - Manning"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "DISABLED"
      + type              = "SIMPLE"
      + uri               = "https://HE3629882.us.create.litera.com:8446/health"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["FOUNDATION_PING42"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "FOUNDATION - PING test for haynesboone.foundation.litera.com"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "DISABLED"
      + type              = "SIMPLE"
      + uri               = "https://haynesboone.foundation.litera.com/"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["LITIGATE_PING1"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "LITIGATE - PING test for apac.literalitigate.com"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "DISABLED"
      + type              = "SIMPLE"
      + uri               = "http://apac.literalitigate.com"
      + verify_ssl        = false
    }

  # newrelic_synthetics_monitor.synthetic_monitor["LITIGATE_PING2"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "LITIGATE - PING test for app.literalitigate.com"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "DISABLED"
      + type              = "SIMPLE"
      + uri               = "https://app.literalitigate.com"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["LITIGATE_PING3"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "LITIGATE - PING test for dryrun.literalitigate.com"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "DISABLED"
      + type              = "SIMPLE"
      + uri               = "https://dryrun.literalitigate.com"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["TRANSACT_PING1"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "TRANSACT - PING test for app.au.transact.litera.com"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "DISABLED"
      + type              = "SIMPLE"
      + uri               = "https://app.au.transact.litera.com"
      + verify_ssl        = true
    }

  # newrelic_synthetics_monitor.synthetic_monitor["TRANSACT_PING2"] will be created
  + resource "newrelic_synthetics_monitor" "synthetic_monitor" {
      + account_id        = (known after apply)
      + id                = (known after apply)
      + locations_public  = [
          + "AWS_AP_SOUTHEAST_2",
          + "AWS_EU_WEST_2",
          + "AWS_US_EAST_1",
        ]
      + name              = "TRANSACT - PING test for app.us.transact.litera.com"
      + period            = "EVERY_MINUTE"
      + period_in_minutes = (known after apply)
      + status            = "DISABLED"
      + type              = "SIMPLE"
      + uri               = "https://app.us.transact.litera.com"
      + verify_ssl        = true
    }

Plan: 14 to add, 0 to change, 0 to destroy.

```

### Plan for `template/non-prod`
```terraform

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

### Plan for `template/prod`
```terraform

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.

```

